export const Examples = [
  `
1. **초록스터디 강의 제목** : ex) 학습 테스트로 배우는 스프링 기초<br><br>

---

<br>
1. **진행 중인 단계** : ex) Spring MVC(인증) - 2단계<br><br>

---

<br>
1. **해결하려는 문제가 무엇인가요?** :<br>
ex) 예약 생성 시, NPE가 발생하고 있습니다.<br>
2. **이를 해결하기 위해 본인이 한 시도** :<br>
ex) 예약을 생성할 때, 객체를 참조하고 있는 부분을 확인해보았습니다.<br><br>

---

<br>
1. **코드로 첨부하기 어려운 내용은 스크린샷을 통해 첨부해주세요.**<br>
    답변자가 참고할 만한 코드 첨부(선택) : <br>
    답변자가 참고할 만한 에러 메시지(선택) :<br><br>
    
2. **원하는 답변을 선택해주세요.**<br>
    - [ ]  해결할 수 있는 구체적인 방안을 원합니다<br>
    - [ ]  해결을 위한 힌트를 주세요<br>
  `,

  `**1. 문제 요약**<br><br>

-  **문제:** (예: API 호출 시 401 오류 발생)<br><br>

**2. 상황 설명**<br><br>

-  **작업:** (예: 로그인 기능 구현 중)<br>
-  **파일:** (예: 'login.js')<br><br>

**3. 시도한 방법**<br><br>

-  (예: 요청 형식 변경, CORS 설정 수정)<br><br>

**4. 최종 질문**<br><br>

-  **질문:** (예: "왜 401 오류가 발생하나요?")<br>
  `,

  `**동작원리 등 이론이 궁금한 경우**에 이 템플릿을 사용해주세요.<br><br>

1. **궁금증이 생긴 상황을 알려주세요!**<br>
ex) 예외처리를 하고, 해당 예외상황이 되었을 때 스프링이 어떻게 동작하는지 궁금합니다<br><br>

---

<br>
1. **질문자님이 생각하시는 질문의 키워드를 알려주세요!**<br>
ex) 예외처리<br>
  `,

  ' ',
];
